
## Plan Result (portfolio/base_apne1)

[CI link](https://github.com/LifeTechEase/terraform-aws/actions/runs/4462942172)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 2 to destroy.</code></pre>

* Create
  * aws_iam_policy.deploy_allow_specifics
  * aws_iam_policy.deploy_deny_specifics
* Update
  * module.oidc_github_actions_id_provider.aws_iam_openid_connect_provider.this
  * module.tfstate_s3_bucket.module.s3_bucket.aws_s3_bucket.this
* Delete
  * module.deploy_role.aws_iam_policy.this
* Replace
  * module.deploy_role.aws_iam_role.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.deploy_allow_specifics will be created
  + resource "aws_iam_policy" "deploy_allow_specifics" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "deploy-allow-specifics"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "states:*",
                          + "sso:*",
                          + "ssm:*",
                          + "sqs:*",
                          + "sns:*",
                          + "s3:*",
                          + "route53:*",
                          + "rds:*",
                          + "organizations:*",
                          + "logs:*",
                          + "lambda:*",
                          + "kms:*",
                          + "kinesis:*",
                          + "identitystore:*",
                          + "iam:*",
                          + "firehose:*",
                          + "events:*",
                          + "es:*",
                          + "elasticloadbalancing:*",
                          + "elasticbeanstalk:*",
                          + "elasticache:*",
                          + "ecs:*",
                          + "ecr:*",
                          + "ec2:*",
                          + "dynamodb:*",
                          + "cloudwatch:*",
                          + "cloudfront:*",
                          + "cloudformation:*",
                          + "autoscaling:*",
                          + "application-autoscaling:*",
                          + "apigateway:*",
                          + "acm:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSpecifics"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = {
          + "pl:environment" = "portfolio"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          + "pl:product"     = "terraform-aws"
          + "pl:repository"  = "LifeTechEase/terraform-aws"
          + "pl:source_path" = "./terraform/environments/portfolio/base_apne1"
        }
    }

  # aws_iam_policy.deploy_deny_specifics will be created
  + resource "aws_iam_policy" "deploy_deny_specifics" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "deploy-deny-specifics"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:*Login*",
                          + "iam:*Group*",
                          + "ec2:*ReservedInstances*",
                          + "directconnect:*",
                          + "config:*",
                          + "budgets:*",
                          + "aws-portal:*",
                          + "aws-marketplace:*",
                          + "aws-marketplace-management:*",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "DenySpecifics"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = {
          + "pl:environment" = "portfolio"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          + "pl:product"     = "terraform-aws"
          + "pl:repository"  = "LifeTechEase/terraform-aws"
          + "pl:source_path" = "./terraform/environments/portfolio/base_apne1"
        }
    }

  # module.deploy_role.data.aws_iam_policy.deploy_allow_specifics will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "deploy_allow_specifics" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "deploy-allow-specifics"
      + path        = (known after apply)
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = (known after apply)
    }

  # module.deploy_role.data.aws_iam_policy.deploy_deny_specifics will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "deploy_deny_specifics" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "deploy-deny-specifics"
      + path        = (known after apply)
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = (known after apply)
    }

  # module.deploy_role.data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:LifeTechEase/terraform-aws:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::072693953877:oidc-provider/token.actions.githubusercontent.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.deploy_role.aws_iam_policy.this will be destroyed
  # (because module.deploy-role.aws_iam_policy.this was moved to module.deploy_role.aws_iam_policy.this, which is not in configuration)
  # (moved from module.deploy-role.aws_iam_policy.this)
  - resource "aws_iam_policy" "this" {
      - arn       = "arn:aws:iam::072693953877:policy/portfolio-private-lab-deploy" -> null
      - id        = "arn:aws:iam::072693953877:policy/portfolio-private-lab-deploy" -> null
      - name      = "portfolio-private-lab-deploy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:*",
                          - "apigateway:*",
                          - "ec2:*",
                          - "rds:*",
                          - "s3:*",
                          - "sns:*",
                          - "states:*",
                          - "ssm:*",
                          - "sqs:*",
                          - "iam:*",
                          - "elasticloadbalancing:*",
                          - "autoscaling:*",
                          - "cloudwatch:*",
                          - "cloudfront:*",
                          - "route53:*",
                          - "ecr:*",
                          - "logs:*",
                          - "ecs:*",
                          - "application-autoscaling:*",
                          - "events:*",
                          - "elasticache:*",
                          - "es:*",
                          - "kms:*",
                          - "dynamodb:*",
                          - "kinesis:*",
                          - "firehose:*",
                          - "elasticbeanstalk:*",
                          - "cloudformation:*",
                          - "acm:*",
                          - "organizations:*",
                          - "sso:*",
                          - "identitystore:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowSpecifics"
                    },
                  - {
                      - Action   = [
                          - "iam:*Login*",
                          - "iam:*Group*",
                          - "aws-portal:*",
                          - "budgets:*",
                          - "config:*",
                          - "directconnect:*",
                          - "aws-marketplace:*",
                          - "aws-marketplace-management:*",
                          - "ec2:*ReservedInstances*",
                        ]
                      - Effect   = "Deny"
                      - Resource = "*"
                      - Sid      = "DenySpecifics"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPARB3HFWVKXTUKPMB5J" -> null
      - tags      = {
          - "pl:product"     = "private-lab"
          - "pl:repository"  = "tqer39/private-lab"
          - "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1"
        } -> null
      - tags_all  = {
          - "pl:environment" = "portfolio"
          - "pl:iac"         = "terraform"
          - "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          - "pl:product"     = "private-lab"
          - "pl:repository"  = "tqer39/private-lab"
          - "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1"
        } -> null
    }

  # module.deploy_role.aws_iam_role.this must be replaced
  # (moved from module.deploy-role.aws_iam_role.this)
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::072693953877:role/portfolio-private-lab-deploy" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = "repo:LifeTechEase/terraform-aws:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::072693953877:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::577523824419:role/management-private-lab-deploy"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ create_date           = "2022-08-06T23:21:14Z" -> (known after apply)
      ~ id                    = "portfolio-private-lab-deploy" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::072693953877:policy/portfolio-private-lab-deploy",
        ] -> (known after apply)
      ~ name                  = "portfolio-private-lab-deploy" -> "portfolio-terraform-aws-deploy" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {
          - "pl:product"     = "private-lab"
          - "pl:repository"  = "tqer39/private-lab"
          - "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1"
        } -> null
      ~ tags_all              = {
          ~ "pl:product"     = "private-lab" -> "terraform-aws"
          ~ "pl:repository"  = "tqer39/private-lab" -> "LifeTechEase/terraform-aws"
          ~ "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1" -> "./terraform/environments/portfolio/base_apne1"
            # (3 unchanged elements hidden)
        }
      ~ unique_id             = "AROARB3HFWVKS4I4AFMVR" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.oidc_github_actions_id_provider.aws_iam_openid_connect_provider.this will be updated in-place
  # (moved from module.oidc-github-actions-id-provider.aws_iam_openid_connect_provider.this)
  ~ resource "aws_iam_openid_connect_provider" "this" {
        id              = "arn:aws:iam::072693953877:oidc-provider/token.actions.githubusercontent.com"
      ~ tags            = {
          - "pl:product"     = "private-lab" -> null
          - "pl:repository"  = "tqer39/private-lab" -> null
          - "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1" -> null
        }
      ~ tags_all        = {
          ~ "pl:product"     = "private-lab" -> "terraform-aws"
          ~ "pl:repository"  = "tqer39/private-lab" -> "LifeTechEase/terraform-aws"
          ~ "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1" -> "./terraform/environments/portfolio/base_apne1"
            # (3 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.tfstate_s3_bucket.module.s3_bucket.aws_s3_bucket.this will be updated in-place
  # (moved from module.tfstate-s3-bucket.module.s3-bucket.aws_s3_bucket.this)
  ~ resource "aws_s3_bucket" "this" {
        id                          = "terraform-tfstate-tqer39-072693953877-ap-northeast-1"
      ~ tags                        = {
          - "pl:product"     = "private-lab" -> null
          - "pl:repository"  = "tqer39/private-lab" -> null
          - "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1" -> null
        }
      ~ tags_all                    = {
          ~ "pl:product"     = "private-lab" -> "terraform-aws"
          ~ "pl:repository"  = "tqer39/private-lab" -> "LifeTechEase/terraform-aws"
          ~ "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1" -> "./terraform/environments/portfolio/base_apne1"
            # (3 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.tfstate-s3-bucket.module.s3-bucket.aws_s3_bucket_public_access_block.this has moved to module.tfstate_s3_bucket.module.s3_bucket.aws_s3_bucket_public_access_block.this
    resource "aws_s3_bucket_public_access_block" "this" {
        id                      = "terraform-tfstate-tqer39-072693953877-ap-northeast-1"
        # (5 unchanged attributes hidden)
    }

  # module.tfstate-s3-bucket.module.s3-bucket.aws_s3_bucket_versioning.this[0] has moved to module.tfstate_s3_bucket.module.s3_bucket.aws_s3_bucket_versioning.this[0]
    resource "aws_s3_bucket_versioning" "this" {
        id     = "terraform-tfstate-tqer39-072693953877-ap-northeast-1"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":192,"Program":"tfcmt","SHA1":"8f133e94ea16e0a5fbc9312855fc40ede002a979","Target":"portfolio/base_apne1","Vars":{},"WorkflowName":"Terraform - AWS - Portfolio"} -->